<img class="img-responsive" src="http://media02.hongkiat.com/programming-jokes/joke-coffee-code.jpg" />
<img class="img-responsive" src="/jokes/img/joke-coffee-code.jpg" />
10. Доналд Кнут

Защо: Наричан е още „бащата на анализа на алгоритми“ заради приносите, които прави към систематизирането на различните видове алгоритми и тяхната сложност. Автор е и на един (макар и все още недовършен) от най-известните литературни трудове в областта: „Изкуството на компютърното програмиране“.
10. Доналд Кнут
<br>
<br>Защо: Наричан е още „бащата на анализа на алгоритми“ заради приносите, които прави към систематизирането на различните видове алгоритми и тяхната сложност. Автор е и на един (макар и все още недовършен) от най-известните литературни трудове в областта: „Изкуството на компютърното програмиране“.
10. Доналд Кнут
<br>
<br>Защо: Наричан е още „бащата на анализа на алгоритми“ заради приносите, които прави към систематизирането на различните видове алгоритми и тяхната сложност. Автор е и на един (макар и все още недовършен) от най-известните литературни трудове в областта: „Изкуството на компютърното програмиране“.
